Repository: kareem7199/NeuroTumAI.Backend
Catalog: NeuroTumAI.Core/Resources/Validation/ValidationResources.*.resx
Languages: ar

# AddressRequired
source: Address is required.
ar: العنوان مطلوب.

# ClinicIdRequired
source: The clinic ID is required.
ar: معرف العيادة مطلوب.

# CommentLength
source: Comment can't exceed 1000 characters.
ar: لا يمكن أن يتجاوز التعليق 1000 حرف.

# CommentRequired
source: Comment is required.
ar: التعليق مطلوب.

# ContentLength
source: Content must be between 10 and 5000 characters.
ar: يجب أن يكون المحتوى بين 10 و 5000 حرف.

# ContentRequired
source: Content is required.
ar: المحتوى مطلوب.

# DateRequired
source: Date is required.
ar: مطلوب اختيار التاريخ.

# DayOfWeekRequired
source: The day of the week is required.
ar: يجب تحديد يوم الأسبوع.

# DetectionClass_MinLength
source: Detection class must be at least 1 character long.
ar: يجب ألا يقل عدد أحرف فئة الاكتشاف عن حرف واحد.

# DetectionClass_Required
source: Detection class is required.
ar: فئة الاكتشاف مطلوبة.

# dob_invalid
source: Invalid date format.
ar: تنسيق التاريخ غير صالح.

# dob_required
source: Date of birth is required.
ar: تاريخ الميلاد مطلوب.

# DoctorIdRequired
source: Doctor ID is required.
ar: رقم الطبيب مطلوب.

# email_invalid
source: Invalid email format.
ar: تنسيق البريد الإلكتروني غير صالح.

# email_required
source: Email is required.
ar: البريد الإلكتروني مطلوب.

# Findings_MinLength
source: Findings must be at least 1 character long.
ar: يجب ألا يقل عدد أحرف النتائج عن حرف واحد.

# Findings_Required
source: Findings are required.
ar: الحقول الخاصة بالنتائج مطلوبة.

# fullName_maxLength
source: Full name must not exceed 50 characters.
ar: يجب ألا يتجاوز الاسم الكامل 50 حرفًا.

# fullName_required
source: Full name is required.
ar: الاسم الكامل مطلوب.

# fullName_twoWords
source: Full name must contain only letters and exactly one space between first and last name.
ar: يجب أن يحتوي الاسم الكامل على حروف فقط ومسافة واحدة بين الاسم الأول والأخير.

# gender_invalid
source: Gender must be Male or Female.
ar: يجب أن يكون الجنس ذكر أو أنثى.

# gender_required
source: Gender is required.
ar: الجنس مطلوب.

# latitude_range
source: Latitude must be between -90 and 90.
ar: يجب أن يكون خط العرض بين -90 و 90.

# LicenseDocumentBackRequired
source: The back license document is required.
ar: يجب رفع صورة خلفية لمستند التصريح.

# LicenseDocumentFrontRequired
source: The front license document is required.
ar: يجب رفع صورة أمامية لمستند التصريح.

# LicenseDocumentRequired
source: The license document is required.
ar: يجب رفع صورة لمستند التصريح.

# longitude_range
source: Longitude must be between -180 and 180.
ar: يجب أن يكون خط الطول بين -180 و 180.

# MessageTooLong
source: Message cannot exceed 1000 characters.
ar: يجب ألا تتجاوز الرسالة 1000 حرف.

# password_complexity
source: Password must contain at least one uppercase letter, one lowercase letter, one number, and one special character.
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل، وحرف صغير، ورقم، وحرف خاص.

# password_minLength
source: Password must be at least 6 characters long.
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل.

# password_required
source: Password is required.
ar: كلمة المرور مطلوبة.

# PhoneNumberRequired
source: Phone number is required.
ar: رقم الهاتف مطلوب.

# ProfilePictureRequired
source: Profile Picture is required.
ar: الصورة الشخصية مطلوبة.

# Reasoning_MinLength
source: Reasoning must be at least 1 character long.
ar: يجب ألا يقل عدد أحرف التفسير عن حرف واحد.

# Reasoning_Required
source: Reasoning is required.
ar: الحقول الخاصة بالتفسير مطلوبة.

# RequiredMessage
source: Please enter your message.
ar: الرجاء إدخال الرسالة.

# SlotIdRequired
source: Slot is required.
ar: مطلوب اختيار الموعد.

# StarsRange
source: Stars must be between 1 and 5.
ar: يجب أن يكون التقييم بين 1 و 5.

# StarsRequired
source: Stars are required.
ar: حقل التقييم مطلوب.

# StartTimeRange
source: The start time must be between 00:00 and 23:59.
ar: يجب أن يكون الوقت الابتدائي بين 00:00 و 23:59.

# StartTimeRequired
source: The start time is required.
ar: الوقت الابتدائي مطلوب.

# TitleLength
source: Title must be between 3 and 100 characters.
ar: يجب أن يكون العنوان بين 3 و 100 حرف.

# TitleRequired
source: Title is required.
ar: العنوان مطلوب.

# TokenInvalid
source: Token must be exactly 6 digits.
ar: يجب أن يتكون الرمز من 6 أرقام.

# TokenRequired
source: Token is required.
ar: الرمز مطلوب.

# UniqueEmail
source: This email is already in use.
ar: هذا البريد الإلكتروني مستخدم بالفعل.

# UsernameTaken
source: Username is already taken.
ar: اسم المستخدم محجوز بالفعل.

# username_maxLength
source: Username must not exceed 20 characters.
ar: يجب ألا يتجاوز اسم المستخدم 20 حرفًا.

# username_minLength
source: Username must be at least 3 characters long.
ar: يجب أن يتكون اسم المستخدم من 3 أحرف على الأقل.

# username_required
source: Username is required.
ar: اسم المستخدم مطلوب.
